// BSLLS:LatinAndCyrillicSymbolInWord-off
#Использовать 1bdd
#Использовать 1testrunner
#Использовать fs
#Использовать 1commands

Функция ПрогнатьТесты()
	
	Тестер = Новый Тестер;

	ПутьКТестам = ОбъединитьПути(ТекущийСценарий().Каталог, "..", "tests");
	ПутьКОтчетуJUnit = ОбъединитьПути(ТекущийСценарий().Каталог, "..");

	КаталогТестов = Новый Файл(ПутьКТестам);
	Если Не КаталогТестов.Существует() Тогда
		Сообщить(СтрШаблон("Не найден каталог тестов %1", ПутьКТестам));
		Возврат Истина;
	КонецЕсли;

	РезультатТестирования = Тестер.ТестироватьКаталог(
		КаталогТестов,
		Новый Файл(ПутьКОтчетуJUnit)
	);

	Успешно = РезультатТестирования = 0;
	
	Возврат Успешно;
КонецФункции

Функция ПрогнатьФичи_core(Знач КаталогФайловПокрытия)

	ПутьКОтчетам = ОбъединитьПути("build", "reports");
	ФС.ОбеспечитьКаталог(ПутьКОтчетам);

	ПутьОтчетаJUnit = ОбъединитьПути(ПутьКОтчетам, "bdd-core-log.xml");

	КаталогФич = ОбъединитьПути("features", "core");

	Файл_КаталогФич = Новый Файл(КаталогФич);

	ИсполнительБДД = Новый ИсполнительБДД;

	Если ЗначениеЗаполнено(КаталогФайловПокрытия) Тогда
		ИсполнительБДД.СохранитьВКонтекст("ПризнакСтатистикиСкриптовOnescript", Новый Файл(КаталогФайловПокрытия));
	КонецЕсли;

	РезультатыВыполнения = ИсполнительБДД.ВыполнитьФичу(Файл_КаталогФич, Файл_КаталогФич);
	ИтоговыйРезультатВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатыВыполнения);

	СтатусыВыполнения = ИсполнительБДД.ВозможныеСтатусыВыполнения();

	СтатусВыполнения = СтатусыВыполнения.НеВыполнялся;
	Если РезультатыВыполнения.Строки.Количество() > 0 Тогда

		СтатусВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатыВыполнения);
		ИсполнительБДД.ПоказатьПроблемныеСценарии(РезультатыВыполнения);

		ИсполнительБДД.ВывестиИтоговыеРезультатыВыполнения(РезультатыВыполнения, Файл_КаталогФич.ЭтоКаталог());
	КонецЕсли;

	ГенераторОтчетаJUnit = Новый ГенераторОтчетаJUnit;
	ГенераторОтчетаJUnit.Сформировать(РезультатыВыполнения, СтатусВыполнения, ПутьОтчетаJUnit);

	Сообщить(СтрШаблон("Результат прогона фич <%1>. Путь %2
	|", ИтоговыйРезультатВыполнения, КаталогФич));

	Возврат ИтоговыйРезультатВыполнения <> СтатусыВыполнения.Сломался;
КонецФункции

Функция ПрогнатьФичи_cmd(Знач КаталогФайловПокрытия)

	КаталогПроекта = ОбъединитьПути(ТекущийСценарий().Каталог, "..");

	ПутьКПриложению = ОбъединитьПути(КаталогПроекта, "src", "cmd", "gitsync.os");

	ФайлПутьКПриложению = Новый Файл(ПутьКПриложению);

	УстановитьПеременнуюСреды("GITSYNC_TESTING_PATH", ФайлПутьКПриложению.ПолноеИмя);

	ПутьКОтчетам = ОбъединитьПути("build", "reports");
	ФС.ОбеспечитьКаталог(ПутьКОтчетам);

	ПутьОтчетаJUnit = ОбъединитьПути(ПутьКОтчетам, "bdd-cmd-log.xml");

	КаталогФич = ОбъединитьПути("features", "cmd");

	Файл_КаталогФич = Новый Файл(КаталогФич);

	ИсполнительБДД = Новый ИсполнительБДД;

	Если ЗначениеЗаполнено(КаталогФайловПокрытия) Тогда
		ИсполнительБДД.СохранитьВКонтекст("ПризнакСтатистикиСкриптовOnescript", Новый Файл(КаталогФайловПокрытия));
	КонецЕсли;

	РезультатыВыполнения = ИсполнительБДД.ВыполнитьФичу(Файл_КаталогФич, Файл_КаталогФич);
	ИтоговыйРезультатВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатыВыполнения);

	СтатусыВыполнения = ИсполнительБДД.ВозможныеСтатусыВыполнения();

	СтатусВыполнения = СтатусыВыполнения.НеВыполнялся;
	Если РезультатыВыполнения.Строки.Количество() > 0 Тогда

		СтатусВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатыВыполнения);
		ИсполнительБДД.ПоказатьПроблемныеСценарии(РезультатыВыполнения);

		ИсполнительБДД.ВывестиИтоговыеРезультатыВыполнения(РезультатыВыполнения, Файл_КаталогФич.ЭтоКаталог());
	КонецЕсли;

	ГенераторОтчетаJUnit = Новый ГенераторОтчетаJUnit;
	ГенераторОтчетаJUnit.Сформировать(РезультатыВыполнения, СтатусВыполнения, ПутьОтчетаJUnit);

	Сообщить(СтрШаблон("Результат прогона фич <%1>. Путь %2
	|", ИтоговыйРезультатВыполнения, КаталогФич));

	Возврат ИтоговыйРезультатВыполнения <> СтатусыВыполнения.Сломался;
КонецФункции

Функция ПрогнатьФичи_exe(Знач КаталогФайловПокрытия)

	СобратьEXE();
	КаталогПроекта = ОбъединитьПути(ТекущийСценарий().Каталог, "..");

	ПутьКПриложению = ОбъединитьПути(КаталогПроекта, "bin", "gitsync.exe");

	ФайлПутьКПриложению = Новый Файл(ПутьКПриложению);

	УстановитьПеременнуюСреды("GITSYNC_TESTING_PATH", ФайлПутьКПриложению.ПолноеИмя);

	ПутьКОтчетам = ОбъединитьПути("build", "reports");
	ФС.ОбеспечитьКаталог(ПутьКОтчетам);

	ПутьОтчетаJUnit = ОбъединитьПути(ПутьКОтчетам, "bdd-exe-log.xml");

	КаталогФич = ОбъединитьПути("features", "cmd");

	Файл_КаталогФич = Новый Файл(КаталогФич);

	ИсполнительБДД = Новый ИсполнительБДД;

	Если ЗначениеЗаполнено(КаталогФайловПокрытия) Тогда
		ИсполнительБДД.СохранитьВКонтекст("ПризнакСтатистикиСкриптовOnescript", Новый Файл(КаталогФайловПокрытия));
	КонецЕсли;

	РезультатыВыполнения = ИсполнительБДД.ВыполнитьФичу(Файл_КаталогФич, Файл_КаталогФич);
	ИтоговыйРезультатВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатыВыполнения);

	СтатусыВыполнения = ИсполнительБДД.ВозможныеСтатусыВыполнения();

	СтатусВыполнения = СтатусыВыполнения.НеВыполнялся;
	Если РезультатыВыполнения.Строки.Количество() > 0 Тогда

		СтатусВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатыВыполнения);
		ИсполнительБДД.ПоказатьПроблемныеСценарии(РезультатыВыполнения);

		ИсполнительБДД.ВывестиИтоговыеРезультатыВыполнения(РезультатыВыполнения, Файл_КаталогФич.ЭтоКаталог());
	КонецЕсли;

	ГенераторОтчетаJUnit = Новый ГенераторОтчетаJUnit;
	ГенераторОтчетаJUnit.Сформировать(РезультатыВыполнения, СтатусВыполнения, ПутьОтчетаJUnit);

	Сообщить(СтрШаблон("Результат прогона фич <%1>. Путь %2
	|", ИтоговыйРезультатВыполнения, КаталогФич));

	Возврат ИтоговыйРезультатВыполнения <> СтатусыВыполнения.Сломался;
КонецФункции

Процедура СобратьEXE()
	
	КомандаOpm = Новый Команда;
	КомандаOpm.УстановитьКоманду("opm");
	КомандаOpm.ДобавитьПараметр("run make");

	КодВозврата = КомандаOpm.Исполнить();

	Если КодВозврата <> 0  Тогда
		ВызватьИсключение КомандаOpm.ПолучитьВывод();
	КонецЕсли;

	Сообщить("Сборка exe завершена");

КонецПроцедуры

Функция ПрогнатьФичи_opm(Знач КаталогФайловПокрытия)

	ПутьКОтчетам = ОбъединитьПути("build", "reports");
	ФС.ОбеспечитьКаталог(ПутьКОтчетам);

	ПутьОтчетаJUnit = ОбъединитьПути(ПутьКОтчетам, "bdd-opm-log.xml");

	КаталогФич = ОбъединитьПути("features", "opm");

	Файл_КаталогФич = Новый Файл(КаталогФич);

	ИсполнительБДД = Новый ИсполнительБДД;

	Если ЗначениеЗаполнено(КаталогФайловПокрытия) Тогда
		ИсполнительБДД.СохранитьВКонтекст("ПризнакСтатистикиСкриптовOnescript", Новый Файл(КаталогФайловПокрытия));
	КонецЕсли;

	РезультатыВыполнения = ИсполнительБДД.ВыполнитьФичу(Файл_КаталогФич, Файл_КаталогФич);
	ИтоговыйРезультатВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатыВыполнения);

	СтатусыВыполнения = ИсполнительБДД.ВозможныеСтатусыВыполнения();

	СтатусВыполнения = СтатусыВыполнения.НеВыполнялся;
	Если РезультатыВыполнения.Строки.Количество() > 0 Тогда

		СтатусВыполнения = ИсполнительБДД.ПолучитьИтоговыйСтатусВыполнения(РезультатыВыполнения);
		ИсполнительБДД.ПоказатьПроблемныеСценарии(РезультатыВыполнения);

		ИсполнительБДД.ВывестиИтоговыеРезультатыВыполнения(РезультатыВыполнения, Файл_КаталогФич.ЭтоКаталог());
	КонецЕсли;

	ГенераторОтчетаJUnit = Новый ГенераторОтчетаJUnit;
	ГенераторОтчетаJUnit.Сформировать(РезультатыВыполнения, СтатусВыполнения, ПутьОтчетаJUnit);

	Сообщить(СтрШаблон("Результат прогона фич <%1>. Путь %2
	|", ИтоговыйРезультатВыполнения, КаталогФич));

	Возврат ИтоговыйРезультатВыполнения <> СтатусыВыполнения.Сломался;
КонецФункции


Функция ПрогнатьФичи(Знач КаталогФайловПокрытия)

	ФичиПрошли_core = ПрогнатьФичи_core(КаталогФайловПокрытия);
	ФичиПрошли_cmd = ПрогнатьФичи_cmd(КаталогФайловПокрытия);
	
	// Закомментировано, т.к. при сборке exe возникает ошибка
	// ФичиПрошли_exe = ПрогнатьФичи_exe(КаталогФайловПокрытия);
	ФичиПрошли_exe = Истина;

	// ПрогнатьФичи_opm всегда выполнять последней, т.к. в процессе ее выполнения очищается ./oscript_modules
	ФичиПрошли_opm = ПрогнатьФичи_opm(КаталогФайловПокрытия);

	Возврат
		ФичиПрошли_opm 
		И ФичиПрошли_core
		И ФичиПрошли_cmd
		И ФичиПрошли_exe;
КонецФункции

ИмяКаталогаФайловПокрытия = "coverage";
ТекКаталог = ТекущийКаталог();
КаталогФайловПокрытия = "";

Для Каждого Элемент Из АргументыКоманднойСтроки Цикл
	Если Элемент = "coverage" Тогда

		КаталогФайловПокрытия = ОбъединитьПути(ТекущийКаталог(), ".", ИмяКаталогаФайловПокрытия);
		ФС.ОбеспечитьПустойКаталог(КаталогФайловПокрытия);

		Прервать;
	КонецЕсли;
КонецЦикла;

УстановитьТекущийКаталог(ТекКаталог);

ТестыПрошли = Истина;

Попытка
	ТестыПрошли = ПрогнатьТесты();
Исключение
	ТестыПрошли = Ложь;
	Сообщить(СтрШаблон("Тесты через 1testrunner выполнены неудачно
	|%1", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
КонецПопытки;

ФичиПрошли = Истина;

Попытка
	ФичиПрошли = ПрогнатьФичи(КаталогФайловПокрытия);
Исключение
	ФичиПрошли = Ложь;
	Сообщить(СтрШаблон("Тесты поведения через 1bdd выполнены неудачно
	|%1", ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
КонецПопытки;

Сообщить(СтрШаблон("Результат прогона всех фич <%1>
|", ФичиПрошли));

Если Не ФичиПрошли Или Не ТестыПрошли Тогда
	ВызватьИсключение "Тестирование завершилось неудачно!";
КонецЕсли;
