#Использовать logos

Перем Лог;

#Область Подписки_на_события

#Область Подписка_на_активизацию_плагинов

Процедура ПриАктивизации(ОбъектПодписки) Экспорт

	Лог.Информация("Вызвано событие <ПриАктивизации> для плагина <%1>", Имя());

КонецПроцедуры

#КонецОбласти

#Область Подписка_на_получение_параметров_выполнения

Процедура ПриПолученииПараметров(ПараметрыКоманды) Экспорт

	Лог.Информация("Вызвано событие <ПриПолученииПараметров> для плагина <%1>", Имя());

КонецПроцедуры

#КонецОбласти

#Область Подписки_на_регистрацию_команд_приложения

Процедура ПриРегистрацииКомандыПриложения(ИмяКоманды, КлассРеализации) Экспорт

	Лог.Информация("Вызвано событие <ПриРегистрацииКомандыПриложения> для плагина <%1>", Имя());

КонецПроцедуры

#КонецОбласти

#Область Подписки_на_начало_и_окончания_выполнения

Процедура ПередНачаломВыполнения(ПутьКХранилищу, КаталогРабочейКопии) Экспорт

	Лог.Информация("Вызвано событие <ПередНачаломВыполнения> для плагина <%1>", Имя());

КонецПроцедуры

Процедура ПослеОкончанияВыполнения(ПутьКХранилищу, КаталогРабочейКопии) Экспорт

	Лог.Информация("Вызвано событие <ПослеОкончанияВыполнения> для плагина <%1>", Имя());

КонецПроцедуры

#КонецОбласти

#Область Подписки_на_получение_таблицы_версий

Процедура ПриПолученииТаблицыВерсий(ТаблицаВерсий, ПутьКХранилищу, СтандартнаяОбработка) Экспорт

	Лог.Информация("Вызвано событие <ПриПолученииТаблицыВерсий> для плагина <%1>", Имя());

КонецПроцедуры

Процедура ПослеПолученияТаблицыВерсий(ТаблицаВерсий, ПутьКХранилищу) Экспорт

	Лог.Информация("Вызвано событие <ПослеПолученияТаблицыВерсий> для плагина <%1>", Имя());

КонецПроцедуры

#КонецОбласти

#Область Подписки_на_получение_таблицы_пользователей

Процедура ПриПолученииТаблицыПользователей(ТаблицаПользователей, ПутьКХранилищу, СтандартнаяОбработка) Экспорт

	Лог.Информация("Вызвано событие <ПриПолученииТаблицыПользователей> для плагина <%1>", Имя());

КонецПроцедуры

Процедура ПослеПолученияТаблицыПользователей(ТаблицаПользователей, ПутьКХранилищу) Экспорт

	Лог.Информация("Вызвано событие <ПослеПолученияТаблицыПользователей> для плагина <%1>", Имя());

КонецПроцедуры

#КонецОбласти

#Область Подписки_на_обработки_строки_версии

Процедура ПередНачаломЦиклаОбработкиВерсий(ТаблицаИсторииХранилища, ТекущаяВерсия, СледующаяВерсия, МаксимальнаяВерсияДляРазбора) Экспорт

	Лог.Информация("Вызвано событие <ПередНачаломЦиклаОбработкиВерсий> для плагина <%1>", Имя());

КонецПроцедуры

Процедура ПередОбработкойВерсииХранилища(СтрокаВерсии, ТекущаяВерсия) Экспорт

	Лог.Информация("Вызвано событие <ПередОбработкойВерсииХранилища> для плагина <%1>", Имя());

КонецПроцедуры

Процедура ПриОбработкеВерсииХранилища(СтрокаВерсии, ТекущаяВерсия) Экспорт

	Лог.Информация("Вызвано событие <ПриОбработкеВерсииХранилища> для плагина <%1>", Имя());

КонецПроцедуры

Процедура ПослеОбработкиВерсииХранилища(СтрокаВерсии, ТекущаяВерсия) Экспорт

	Лог.Информация("Вызвано событие <ПослеОбработкиВерсииХранилища> для плагина <%1>", Имя());

КонецПроцедуры

#КонецОбласти

#Область Подписки_на_выполнение_коммита

Процедура ПередКоммитом(КаталогРабочейКопии, Комментарий, Автор, Дата) Экспорт

	Лог.Информация("Вызвано событие <ПередКоммитом> для плагина <%1>", Имя());

КонецПроцедуры

Процедура ПриКоммите(ГитРепозиторий,
						Комментарий,
						ПроиндексироватьОтслеживаемыеФайлы,
						ИмяФайлаКомментария,
						авторДляГит,
						ДатаДляГит,
						Коммитер,
						ДатаКоммитера) Экспорт

	Лог.Информация("Вызвано событие <ПриКоммите> для плагина <%1>", Имя());

КонецПроцедуры

Процедура ПослеКоммита(ГитРепозиторий, КаталогРабочейКопии) Экспорт

	Лог.Информация("Вызвано событие <ПослеКоммита> для плагина <%1>", Имя());

КонецПроцедуры

#КонецОбласти

#Область Подписки_на_начало_и_окончания_выгрузки_версии_конфигурации

Процедура ПередНачаломВыгрузкиВерсииХранилищаКонфигурации(Конфигуратор, КаталогРабочейКопии, ПутьКХранилищу, НомерВерсии) Экспорт

	Лог.Информация("Вызвано событие <ПередНачаломВыгрузкиВерсииХранилищаКонфигурации> для плагина <%1>", Имя());

КонецПроцедуры

Процедура ПослеОкончанияВыгрузкиВерсииХранилищаКонфигурации(Конфигуратор, КаталогРабочейКопии, ПутьКХранилищу, НомерВерсии) Экспорт

	Лог.Информация("Вызвано событие <ПослеОкончанияВыгрузкиВерсииХранилищаКонфигурации> для плагина <%1>", Имя());

КонецПроцедуры

#КонецОбласти

#Область Подписки_на_загрузку_версии_конфигурации_из_хранилища

Процедура ПередЗагрузкойВерсииХранилищаКонфигурации(Конфигуратор, КаталогРабочейКопии, ПутьКХранилищу, НомерВерсии) Экспорт

	Лог.Информация("Вызвано событие <ПередЗагрузкойВерсииХранилищаКонфигурации> для плагина <%1>", Имя());

КонецПроцедуры

Процедура ПриЗагрузкеВерсииХранилищаВКонфигурацию(Конфигуратор, КаталогРабочейКопии, ПутьКХранилищу, НомерВерсии, СтандартнаяОбработка) Экспорт

	Лог.Информация("Вызвано событие <ПриЗагрузкеВерсииХранилищаВКонфигурацию> для плагина <%1>", Имя());

КонецПроцедуры

Процедура ПослеЗагрузкиВерсииХранилищаВКонфигурацию(Конфигуратор, КаталогРабочейКопии, ПутьКХранилищу, НомерВерсии) Экспорт

	Лог.Информация("Вызвано событие <ПослеЗагрузкиВерсииХранилищаВКонфигурацию> для плагина <%1>", Имя());

КонецПроцедуры

#КонецОбласти

#Область Подписки_на_выгрузку_конфигурации_в_исходники

Процедура ПередВыгрузкойКонфигурациюВИсходники(Конфигуратор, КаталогРабочейКопии, КаталогВыгрузки, ПутьКХранилищу, НомерВерсии) Экспорт

	Лог.Информация("Вызвано событие <ПередВыгрузкойКонфигурациюВИсходники> для плагина <%1>", Имя());

КонецПроцедуры

Процедура ПриВыгрузкеКонфигурациюВИсходники(Конфигуратор, КаталогВыгрузки, СтандартнаяОбработка) Экспорт

	Лог.Информация("Вызвано событие <ПриВыгрузкеКонфигурациюВИсходники> для плагина <%1>", Имя());

КонецПроцедуры

Процедура ПослеВыгрузкиКонфигурациюВИсходники(Конфигуратор, КаталогВыгрузки) Экспорт

	Лог.Информация("Вызвано событие <ПослеВыгрузкиКонфигурациюВИсходники> для плагина <%1>", Имя());

КонецПроцедуры

#КонецОбласти

#Область Подписки_на_очистку_каталога_рабочей_версии

Процедура ПередОчисткойКаталогаРабочейКопии(Конфигуратор, КаталогРабочейКопии, КаталогВыгрузки, ПутьКХранилищу, НомерВерсии) Экспорт

	Лог.Информация("Вызвано событие <ПередОчисткойКаталогаРабочейКопии> для плагина <%1>", Имя());

КонецПроцедуры

Процедура ПриОчисткеКаталогаРабочейКопии(КаталогРабочейКопии, СоответствиеИменФайловДляПропуска, СтандартнаяОбработка) Экспорт

	Лог.Информация("Вызвано событие <ПриОчисткеКаталогаРабочейКопии> для плагина <%1>", Имя());

КонецПроцедуры

Процедура ПослеОчисткиКаталогаРабочейКопии(КаталогРабочейКопии, СоответствиеИменФайловДляПропуска) Экспорт

	Лог.Информация("Вызвано событие <ПослеОчисткиКаталогаРабочейКопии> для плагина <%1>", Имя());

КонецПроцедуры

#КонецОбласти

#Область Подписки_на_перемещение_в_каталог_рабочей_копии

Процедура ПередПеремещениемВКаталогРабочейКопии(Конфигуратор, КаталогРабочейКопии, КаталогВыгрузки, ПутьКХранилищу, НомерВерсии) Экспорт

	Лог.Информация("Вызвано событие <ПередПеремещениемВКаталогРабочейКопии> для плагина <%1>", Имя());

КонецПроцедуры

Процедура ПриПеремещенииВКаталогРабочейКопии(КаталогРабочейКопии, КаталогВыгрузки, СтандартнаяОбработка) Экспорт

	Лог.Информация("Вызвано событие <ПриПеремещенииВКаталогРабочейКопии> для плагина <%1>", Имя());
	
КонецПроцедуры

Процедура ПослеПеремещенияВКаталогРабочейКопии(КаталогРабочейКопии, КаталогВыгрузки) Экспорт

	Лог.Информация("Вызвано событие <ПослеПеремещенияВКаталогРабочейКопии> для плагина <%1>", Имя());

КонецПроцедуры

#КонецОбласти

#Область Интерфейс_плагина

Функция Версия() Экспорт
	Возврат "0.0.1";
КонецФункции

Функция Описание() Экспорт
	Возврат "Тестовый плагин";
КонецФункции

Функция Справка() Экспорт
	Возврат "Справка плагина";
КонецФункции

Функция Имя() Экспорт
	Возврат "test_plugin";
КонецФункции

Функция ИмяЛога() Экспорт
	Возврат "oscript.lib.gitsync3.test_plugin";
КонецФункции

Функция Приоритет() Экспорт
	Возврат 1;
КонецФункции

#КонецОбласти

Лог = Логирование.ПолучитьЛог(ИмяЛога());

