
#Использовать logos
#Использовать ".."

Перем юТест;
Перем Лог;

Перем мНастройки;

Функция ПолучитьСписокТестов(Тесты) Экспорт
	юТест = Тесты;
	
	Список = Новый Массив;
	Список.Добавить("Тест_ДолженПрочитатьФайлНастроек");
	
	Инициализация();
	
	Возврат Список;
	
КонецФункции

Процедура Инициализация()
	
	ПодключитьСценарий(ОбъединитьПути(ТекущийСценарий().Каталог, "../src/xml-config.os"), "ЧтениеКонфига");
	
	Лог = Логирование.ПолучитьЛог("oscript.app.gitsync");
	Лог.УстановитьУровень(УровниЛога.Отладка);
	
КонецПроцедуры

//////////////////////////////////////////////////////////////////////
// Юнит-тесты

Функция ПрочитатьТестовыеНастройки()
	ФайлНастроек = КаталогFixtures() + "/config.xml";
	ЧтениеКонфига = Новый ЧтениеКонфига();
	мНастройки = ЧтениеКонфига.ПрочитатьНастройкиИзФайла(ФайлНастроек);
КонецФункции

Функция КаталогFixtures()
	Возврат ОбъединитьПути(ТекущийСценарий().Каталог, "fixtures");
КонецФункции

Процедура Тест_ДолженПрочитатьФайлНастроек() Экспорт
	
	ПрочитатьТестовыеНастройки();
	
	// глобальные настройки
	юТест.ПроверитьРавенство("server.com", мНастройки.ДоменПочтыДляGit);
	юТест.ПроверитьРавенство("1cv8.exe"  , мНастройки.ПутьКПлатформе83);
	юТест.ПроверитьРавенство("git"       , мНастройки.ПутьGit);
	
	// репозитарии
	юТест.ПроверитьРавенство(2, мНастройки.Репозитарии.Количество());
	
	юТест.ПроверитьРавенство("test", мНастройки.Репозитарии[0].Имя);
	юТест.ПроверитьРавенство("путь1", мНастройки.Репозитарии[0].КаталогВыгрузки);
	юТест.ПроверитьРавенство("адрес1", мНастройки.Репозитарии[0].GitURL);
	юТест.ПроверитьРавенство("каталог1", мНастройки.Репозитарии[0].КаталогХранилища1С);
	юТест.ПроверитьРавенство(мНастройки.ПутьGit, мНастройки.Репозитарии[0].ПутьGit);
	юТест.ПроверитьРавенство(мНастройки.ПутьКПлатформе83, мНастройки.Репозитарии[0].ПутьКПлатформе83);
	юТест.ПроверитьРавенство(мНастройки.ДоменПочтыДляGit, мНастройки.Репозитарии[0].ДоменПочтыДляGit);
	
	юТест.ПроверитьРавенство("test2", мНастройки.Репозитарии[1].Имя);
	юТест.ПроверитьРавенство("путь2", мНастройки.Репозитарии[1].КаталогВыгрузки);
	юТест.ПроверитьРавенство("адрес2", мНастройки.Репозитарии[1].GitURL);
	юТест.ПроверитьРавенство("каталог2", мНастройки.Репозитарии[1].КаталогХранилища1С);
	юТест.ПроверитьРавенство(мНастройки.ПутьGit, мНастройки.Репозитарии[1].ПутьGit);
	юТест.ПроверитьРавенство(мНастройки.ПутьКПлатформе83, мНастройки.Репозитарии[1].ПутьКПлатформе83);
	юТест.ПроверитьРавенство("gmail.com", мНастройки.Репозитарии[1].ДоменПочтыДляGit);
	
КонецПроцедуры
