//////////////////////////////////////////////////////
// ДАННЫЙ ФАЙЛ ФОРМИРУЕТСЯ АВТОМАТИЧЕСКИ            //
// ВСЕ ВНЕСЕННЫЕ ИЗМЕНЕНИЯ В РУЧНУЮ БУДУТ ПОТЕРЯНЫ  //
//////////////////////////////////////////////////////

///////////////////////////////////
// ИМПОРТ БИБЛИОТЕКИ ПЛАГИНА "preinstalled_plugins_gitsync"
#Использовать "./preinstalled_plugins_gitsync"
///////////////////////////////////

Процедура ПриЗагрузкеБиблиотеки(Путь, СтандартнаяОбработка, Отказ)

	СтандартнаяОбработка = Ложь;

КонецПроцедуры

